{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": [
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.10.2",
          "author": null,
          "description": "Added: testing and CI/CD workflows",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.10.2",
          "publishedOn": "2021-06-01T04:39:30.000Z",
          "wordCount": 268,
          "title": "v1.10.2"
        },
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.9.0",
          "author": null,
          "description": "Added: experimental support for iTunes podcast feed: Demo | Source. With this new release, you can render an audio control to play the mp3 file and display iTunes episode duration. It is \"experimental\" due to these caveats:\n\nThis feature is currently only available through custom template.\niTunes has no strict format requirement for duration. The unit is most likely seconds but can be \"hh:mm:ss\" or \"mm:ss\" for some sources. A future version may expose a human readable string to the template.\nNo image support yet. Some shows might have disabled CORS or use a relative URL for image, which forces osmosfeed to download the image during build. A future version may support it.\nYou can't republish the podcast in the feed output. Supporting this goes beyond the scope of the project at the moment.\nFixed: the articles in template data were not sorted.\nThank you @Zenigata",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.9.0",
          "publishedOn": "2021-05-26T06:02:55.000Z",
          "wordCount": 417,
          "title": "v1.9.0"
        },
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.8.1",
          "author": null,
          "description": "Fixed: UnhandledPromiseRejectionWarning: Error: At least one option must be a string",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.8.1",
          "publishedOn": "2021-05-23T05:40:12.000Z",
          "wordCount": 278,
          "title": "v1.8.1"
        },
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.8.0",
          "author": null,
          "description": "Changed: Smart summary truncation. When there is no dedicated summary (only Atom feed has it, and many sites don't use it) from the source, we check if the content/description (Both Atom and RSS) field is long enough to be full text. If so, it will be truncated into a \"pseudo\" summary. If not, we assume the source used the content field as summary, and it will be displayed in full length.\nThank you: @LooperXX.",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.8.0",
          "publishedOn": "2021-05-23T05:12:08.000Z",
          "wordCount": 341,
          "title": "v1.8.0"
        },
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.7.2",
          "author": null,
          "description": "⚠ Deprecated: To accommodate the monorepo setup, the node version in all templates/demos/examples has changed from 14 to 16. This is not a breaking change as our compile target is still node 14, and node 16 is backward compatible. We still recommend you start using node-version: \"16\" in your .github/workflows/update-feed.yaml today to get the performance/security improvements from the newer node. See example\nChore: Reorganize to monorepo with npm workspace.",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.7.2",
          "publishedOn": "2021-05-17T05:32:19.000Z",
          "wordCount": 336,
          "title": "v1.7.2"
        },
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.7.1",
          "author": null,
          "description": "Fixed: static files were unnecessarily copied for custom templates.",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.7.1",
          "publishedOn": "2021-05-16T02:33:58.000Z",
          "wordCount": 276,
          "title": "v1.7.1"
        },
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.7.0",
          "author": null,
          "description": "Added: templating system. Demo | Source | Docs\nChore: rendering logic refactoring. Adopting functional paradigm.\nThank you @tianheg, @onnyyonn",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.7.0",
          "publishedOn": "2021-05-16T01:42:24.000Z",
          "wordCount": 286,
          "title": "v1.7.0"
        }
      ]
    },
    {
      "title": "freeCodeCamp.org",
      "feedUrl": "https://www.freecodecamp.org/news/rss/",
      "siteUrl": "https://www.freecodecamp.org/news",
      "articles": [
        {
          "id": "60bfd986d3126007592d53a1",
          "author": null,
          "description": "Arduino is an open-source electronics platform based on easy-to-use hardware and software. Arduino boards are able to read inputs - light on a sensor, a finger on a button, or a Twitter message - and turn it into an output - activating a motor, turning on an LED, publishing something",
          "link": "https://www.freecodecamp.org/news/create-your-own-electronics-with-arduino-full-course/",
          "publishedOn": "2021-06-08T21:05:13.000Z",
          "wordCount": 639,
          "title": "Create Your Own Electronics With Arduino - Full Course"
        },
        {
          "id": "60b23b8911ffb70827ef954e",
          "author": null,
          "description": "If you're trying to implement CRUD operations using API endpoints, you might find that it's hard to manage data across multiple components. Or maybe you have a modal, but you want to trigger it from a different component.  Wrapping your head around how to tackle these scenarios can be difficult.",
          "link": "https://www.freecodecamp.org/news/pass-data-between-components-in-react/",
          "publishedOn": "2021-06-08T16:17:32.000Z",
          "wordCount": 1205,
          "title": "How to Pass Data and Events Between Components in React"
        },
        {
          "id": "60be6a3cd3126007592d4a03",
          "author": null,
          "description": "Today we're going to learn CSS Grid properties so that you can make your own responsive websites. I'll explain how each of Grid's properties work along with a CheatSheet that covers everything you can do with Grid. Let's go. 🎖️ Table of Contents: CSS Grid Architecture CSS Grid Chart Grid Parent",
          "link": "https://www.freecodecamp.org/news/css-grid-tutorial-with-cheatsheet/",
          "publishedOn": "2021-06-08T16:02:45.000Z",
          "wordCount": 2548,
          "title": "Complete CSS Grid Tutorial with Cheat Sheet 🎖️"
        },
        {
          "id": "60bbd28eacb62507dd1d99fb",
          "author": null,
          "description": "Learn how to build full stack serverless apps with Supabase and Next.js.",
          "link": "https://www.freecodecamp.org/news/the-complete-guide-to-full-stack-development-with-supabas/",
          "publishedOn": "2021-06-07T23:33:30.000Z",
          "wordCount": 3567,
          "title": "How to Build a Full Stack App with Supabase and Next.js"
        },
        {
          "id": "60be863cd3126007592d4c36",
          "author": null,
          "description": "OpenCV is a popular Python library for real-time computer vision. We just released a new OpenCV course on the freeCodeCamp.org YouTube channel. This course comes directly from the creators of OpenCV and is the perfect course for beginners.  You will learn how to use OpenCV for Computer Vision and",
          "link": "https://www.freecodecamp.org/news/how-to-use-opencv-and-python-for-computer-vision-and-ai/",
          "publishedOn": "2021-06-07T20:54:41.000Z",
          "wordCount": 439,
          "title": "How to Use OpenCV and Python for Computer Vision and AI"
        },
        {
          "id": "5ff625967af2371468bb8645",
          "author": null,
          "description": "Closures are a confusing JavaScript concept to learn, because it's hard to see how they're actually used.  Unlike other concepts such as functions, variables, and objects, you don't always use closures conscientiously and directly. You don't say: Oh! Here I will use a closure as a solution. But at the",
          "link": "https://www.freecodecamp.org/news/closures-in-javascript/",
          "publishedOn": "2021-06-07T18:18:01.000Z",
          "wordCount": 1597,
          "title": "How to Use Closures in JavaScript – A Beginner&#x27;s Guide"
        },
        {
          "id": "60b136d911ffb70827ef912b",
          "author": null,
          "description": "ngClass is a directive in Angular that adds and removes CSS classes on an HTML element. In this article, we are talking about ngClass in Angular only, not ng-class in angular.js. Prerequisites – What is Property Binding?Two things we have to understand first are property binding and interpolation in",
          "link": "https://www.freecodecamp.org/news/angular-ngclass-example/",
          "publishedOn": "2021-06-07T15:01:26.000Z",
          "wordCount": 1547,
          "title": "Angular NgClass Example – How to Add Conditional CSS Classes"
        },
        {
          "id": "60b3480c11ffb70827ef9a88",
          "author": null,
          "description": "If you're building a React app, you want your users to be able to search and get exact results. And if you are getting tons of items from an API, then you need to create a way for users to be able to find various items easily.",
          "link": "https://www.freecodecamp.org/news/search-and-filter-component-in-reactjs/",
          "publishedOn": "2021-06-04T21:34:33.000Z",
          "wordCount": 2174,
          "title": "How to Search and Filter Components in React"
        },
        {
          "id": "60ba33d7acb62507dd1d9050",
          "author": null,
          "description": "Scikit-learn is one of the most popular open-source and free machine learning libraries for Python.  The scikit-learn library contains a lot of efficient tools for machine learning and statistical modeling including classification, regression, clustering, and dimensionality reduction. Many data scientists, machine learning engineers, and researchers rely on this library for",
          "link": "https://www.freecodecamp.org/news/machine-learning-python-new-scikit-learn-features-you-should-know/",
          "publishedOn": "2021-06-04T20:58:07.000Z",
          "wordCount": 1544,
          "title": "Machine Learning in Python – The Top New Scikit-Learn 0.24 Features You Should Know"
        },
        {
          "id": "60b8f5c7acb62507dd1d8500",
          "author": null,
          "description": "I deployed a Discord bot to a 1000+ user server. In the first hour, Deployment Hell struck and my bot crashed. In the next hour, I brought it back, surviving and even thriving in Deployment Hell. In this post, I'll show you how.",
          "link": "https://www.freecodecamp.org/news/recovering-from-deployment-hell-what-i-learned-from-deploying-my-discord-bot-to-a-1000-user-server/",
          "publishedOn": "2021-06-04T20:41:29.000Z",
          "wordCount": 2163,
          "title": "How to Recover from Deployment Hell – What I Learned After My Discord Bot Crashed on a 1000+ User Server"
        },
        {
          "id": "60b2a4c611ffb70827ef9842",
          "author": null,
          "description": "TypeScript has taken the development world by storm. No wonder it has over 15 million weekly downloads on npm. But what is TypeScript, and what do you need to know about it?  In this article, I am going answer those questions. By the end you'll have a grasp of the",
          "link": "https://www.freecodecamp.org/news/learn-typescript-basics/",
          "publishedOn": "2021-06-04T18:01:00.000Z",
          "wordCount": 2225,
          "title": "Learn TypeScript Basics in this Beginner&#x27;s Guide"
        },
        {
          "id": "60b98ebfacb62507dd1d8ec4",
          "author": null,
          "description": "Are you looking for a way to apply Python and machine learning to a real-world application? You should consider Bioinformatics. Bioinformatics is an interdisciplinary field that develops methods and software tools for understanding biological data, in particular when the data sets are large and complex. We just released a course",
          "link": "https://www.freecodecamp.org/news/python-for-bioinformatics-use-machine-learning-and-data-analysis-for-drug-discovery/",
          "publishedOn": "2021-06-04T02:32:22.000Z",
          "wordCount": 390,
          "title": "Python for Bioinformatics: Use Machine Learning and Data Analysis for Drug Discovery"
        },
        {
          "id": "60b11ff811ffb70827ef8f94",
          "author": null,
          "description": "Let’s say you plan to build a website. Before you start, you want to set up a few tools to make your life easier. But which tools should you have? The JavaScript ecosystem is changing so fast that it can be overwhelming to pick the best tools to use.",
          "link": "https://www.freecodecamp.org/news/how-to-set-up-a-front-end-development-project/",
          "publishedOn": "2021-06-03T21:44:03.000Z",
          "wordCount": 3978,
          "title": "JavaScript Tutorial – How to Set Up a Front End Development Project"
        },
        {
          "id": "60afd68611ffb70827ef86d8",
          "author": null,
          "description": "Schofield's Laws of Computing are principles that anyone who works with computers should know. They're focused on data portability, integrity, and security.  Jack Schofield was a British journalist who wrote for The Guardian. During that time, he wrote three particular articles called \"Schofield's Laws of Computing\". Jack didn't create these",
          "link": "https://www.freecodecamp.org/news/schofields-laws-of-computing/",
          "publishedOn": "2021-06-03T18:46:12.000Z",
          "wordCount": 1588,
          "title": "Schofield&#x27;s Laws of Computing – What they Are and Why You Should Know Them"
        },
        {
          "id": "60b7c02cacb62507dd1d7b80",
          "author": null,
          "description": "Let’s suppose you’re planning to visit your neighborhood store to stock up on essentials. What is the first thing you’d do?  Have the answer already? Yes, you'd probably write down a shopping list! Python also has a built-in data structure called List that’s very similar to",
          "link": "https://www.freecodecamp.org/news/lists-in-python-comprehensive-guide/",
          "publishedOn": "2021-06-03T18:42:20.000Z",
          "wordCount": 1748,
          "title": "Lists in Python – A Comprehensive Guide"
        },
        {
          "id": "60affbe411ffb70827ef8951",
          "author": null,
          "description": "A Hackintosh is a non-Mac computer system, made with PC parts, that runs the macOS operating system. In this tutorial, you will learn how to create a Hackintosh. You will learn how to install macOS Big Sur (or any other version of macOS) using OpenCore. The main benefit of a",
          "link": "https://www.freecodecamp.org/news/build-a-hackintosh/",
          "publishedOn": "2021-06-03T18:07:17.000Z",
          "wordCount": 2708,
          "title": "How to Build a Hackintosh - Install MacOS Big Sur on a PC Using OpenCore"
        },
        {
          "id": "60aa708711ffb70827ef5f4b",
          "author": null,
          "description": "If you're new to cloud technologies, you might be confused about the difference between serverless technologies and managed services.  So in this article you'll learn what these terms mean and what the main differences are.    What Are Managed Services? A managed service let the end-user focus on using a service",
          "link": "https://www.freecodecamp.org/news/serverless-fully-managed-service-difference/",
          "publishedOn": "2021-06-03T16:51:37.000Z",
          "wordCount": 1453,
          "title": "Serverless vs Fully Managed Services: What&#x27;s the Difference?"
        },
        {
          "id": "5fff3d3098be260817e495bd",
          "author": null,
          "description": "Cryptography is the science of using codes and ciphers to protect messages. And encryption involves encoding messages so that only the intended recipient can understand the meaning of the message. It's often used to protect data in transit. Encryption is a two way function – that is, you need to be",
          "link": "https://www.freecodecamp.org/news/what-is-a-block-cipher/",
          "publishedOn": "2021-06-03T16:21:19.000Z",
          "wordCount": 2747,
          "title": "Cipher Definition – What is a Block Cipher and How Does it Work to Protect Your Data?"
        },
        {
          "id": "60afce3011ffb70827ef869c",
          "author": null,
          "description": "Git has a feature to \"sign\" commits, but what is signing, and what are the benefits? TL;DR: If you don't care for the details, and just need to get commit signing setup quickly, skip to How to Sign Commits. Signing, or code signing specifically, is the process of using",
          "link": "https://www.freecodecamp.org/news/what-is-commit-signing-in-git/",
          "publishedOn": "2021-06-02T23:14:01.000Z",
          "wordCount": 2282,
          "title": "What is Commit Signing in Git?"
        },
        {
          "id": "60b3a25211ffb70827ef9b39",
          "author": null,
          "description": "In this article, you will learn about environment variables in Vanilla JavaScript. You'll also learn how to serve API keys to your application through the Netlify build command. What are JavaScript environment variables?Environment variables are very common when you're using JavaScript frameworks like React or Vue for creating frontend",
          "link": "https://www.freecodecamp.org/news/how-to-use-environment-variables-in-vanillajs/",
          "publishedOn": "2021-06-02T22:54:18.000Z",
          "wordCount": 1415,
          "title": "How to Use Environment Variables in VanillaJS"
        },
        {
          "id": "60b3ccee11ffb70827ef9bc0",
          "author": null,
          "description": "One of the most difficult things about getting started in a new career as a developer is figuring out exactly what you should be learning – and then translating that into an effective plan. There are so many resources out there for learning, so lack of information is not the problem.",
          "link": "https://www.freecodecamp.org/news/how-to-design-your-own-learning-plan-for-any-tech-stack/",
          "publishedOn": "2021-06-02T21:18:15.000Z",
          "wordCount": 2365,
          "title": "How to Design Your Own Learning Plan for Any Tech Stack"
        },
        {
          "id": "60a699b0906c5207e3a7f5ab",
          "author": null,
          "description": "Configuring your .vimrc file lets you use the full power of Vim. With a customized .vimrc file you can increase your Vim powers tenfold. In this article I will show you a few ways you can customize your .vimrc file. I will go over: Basic SettingsPluginsFoldingVimscriptStatus lineFirst create the following",
          "link": "https://www.freecodecamp.org/news/vimrc-configuration-guide-customize-your-vim-editor/",
          "publishedOn": "2021-06-02T20:44:22.000Z",
          "wordCount": 3441,
          "title": "Vimrc Configuration Guide - How to Customize Your Vim Code Editor with Mappings, Vimscript, Status Line, and More"
        },
        {
          "id": "60b0f11411ffb70827ef8dbc",
          "author": null,
          "description": "Often times you might want your system to communicate with other web servers to get information. For example, let's say a new user wants to sign up for an account on your website. And instead of having to manually fill out a form to send their information to your system,",
          "link": "https://www.freecodecamp.org/news/how-to-make-api-calls-with-fetch/",
          "publishedOn": "2021-06-02T19:39:05.000Z",
          "wordCount": 1155,
          "title": "Fetch API – How to Make a GET Request and POST Request in JavaScript"
        },
        {
          "id": "60b4ff4711ffb70827ef9eb2",
          "author": null,
          "description": "What is Vue.js? Vue.js is a progressive JavaScript frontend framework written by Evan You. It's one of the most powerful and easy to learn frameworks, and it has over 9.5 million downloads per month.  In September 2020, Vue 3 core was released. The new Vue.js release",
          "link": "https://www.freecodecamp.org/news/migrate-from-vue2-to-vue3-with-example-project/",
          "publishedOn": "2021-06-02T19:14:53.000Z",
          "wordCount": 2649,
          "title": "How to Migrate from Vue v.2 to Vue v.3 with a Simple Example Project"
        },
        {
          "id": "60b51f6e11ffb70827ef9f7c",
          "author": null,
          "description": "Today we're going to build and run an ice cream shop and learn asynchronous JavaScript at the same time. Along the way, you'll learn how to use: CallbacksPromisesAsync / AwaitHere's what we'll cover in this article:What is Asynchronous JavaScript?Synchronous vs Asynchronous JavaScriptHow Callbacks Work in JavaScriptHow Promises Work in",
          "link": "https://www.freecodecamp.org/news/javascript-async-await-tutorial-learn-callbacks-promises-async-await-by-making-icecream/",
          "publishedOn": "2021-06-02T14:45:18.000Z",
          "wordCount": 3302,
          "title": "JavaScript Async/Await Tutorial – Learn Callbacks, Promises, and Async/Await in JS by Making Ice Cream 🍧🍨🍦"
        },
        {
          "id": "60b5025111ffb70827ef9ebe",
          "author": null,
          "description": "Let's build an AI model that speaks just like your favorite character and deploy that model as a Discord chatbot. All the coding and deployment happen in the cloud (for free!), so you don't even need a local IDE to follow along.",
          "link": "https://www.freecodecamp.org/news/discord-ai-chatbot/",
          "publishedOn": "2021-06-01T23:47:33.000Z",
          "wordCount": 1861,
          "title": "How to Build a Discord AI Chatbot that Talks Like Your Favorite Character"
        },
        {
          "id": "60b1eed311ffb70827ef9504",
          "author": null,
          "description": "A Pandas dataframe is a two dimensional data structure which allows you to store data in rows and columns. It's very useful when you're analyzing data.  When you have a list of data records in a dataframe, you may need to drop a specific list of rows depending on the",
          "link": "https://www.freecodecamp.org/news/drop-list-of-rows-from-pandas-dataframe/",
          "publishedOn": "2021-06-01T20:47:43.000Z",
          "wordCount": 1416,
          "title": "Data Analytics with Pandas – How to Drop a List of Rows from a Pandas Dataframe"
        },
        {
          "id": "60b668c0acb62507dd1d710b",
          "author": null,
          "description": "Next.js makes developing React applications simpler. It provides a common structure that allows you to build frontend React applications, and transparently handles server-side rendering for you. We just released a full course on the freeCodeCamp.org YouTube channel that will teach you the basics of Next.js.  Kapehe developed",
          "link": "https://www.freecodecamp.org/news/learn-next-js/",
          "publishedOn": "2021-06-01T17:43:56.000Z",
          "wordCount": 407,
          "title": "Learn Next.js and Make React Development Simpler"
        },
        {
          "id": "60acf28e11ffb70827ef6dd9",
          "author": null,
          "description": "Hey everyone, my name is Santosh. In this article, I will tell you how I ramped up my career and ended up increasing my salary as a developer.  I'll share what I learned from each job along the way, how you can stand out, tips for negotiating salary, and how",
          "link": "https://www.freecodecamp.org/news/my-developer-journey-how-i-increased-my-salary-and-got-a-remote-job/",
          "publishedOn": "2021-06-01T16:35:00.000Z",
          "wordCount": 2823,
          "title": "My Developer Journey – How I Got a Remote Job and Increased My Salary While Contributing to Open Source"
        },
        {
          "id": "60aff2d711ffb70827ef8829",
          "author": null,
          "description": "This informative tutorial goes deep into how to get a cybersecurity job, with insights from senior leaders and hiring managers in the field.",
          "link": "https://www.freecodecamp.org/news/how-to-get-a-cybersecurity-job/",
          "publishedOn": "2021-06-01T16:34:00.000Z",
          "wordCount": 2137,
          "title": "How to Get a Cybersecurity Job in 2021"
        },
        {
          "id": "607f5fafdd38b9088c2bd0c9",
          "author": null,
          "description": "When you're debating someone, you want to use all the resources at your disposal to convince them you're right. But you should be careful that you don't end up using a logical fallacy to help you make your point. What is a Logical Fallacy?A logical fallacy is an error",
          "link": "https://www.freecodecamp.org/news/logical-fallacies-definition-fallacy-examples/",
          "publishedOn": "2021-06-01T04:19:48.000Z",
          "wordCount": 6197,
          "title": "Logical Fallacies – Definition and Fallacy Examples"
        },
        {
          "id": "60acf28e11ffb70827ef6dd9",
          "author": null,
          "description": "Hey everyone, my name is Santosh. In this article, I will tell you how I ramped up my career and ended up making $100,000 a year as a developer.  I'll share what I learned from each job along the way, how you can stand out, tips for negotiating salary,",
          "link": "https://www.freecodecamp.org/news/my-developer-journey-how-i-went-from-1000-a-year-to-100000-as-a-dev/",
          "publishedOn": "2021-05-28T22:58:18.000Z",
          "wordCount": 2775,
          "title": "My Developer Journey – How I Went from Making $1,000 to $100,000 a Year"
        },
        {
          "id": "60b08d8811ffb70827ef8c7b",
          "author": null,
          "description": "If you've been following the news lately, you may have noticed a worrisome tech trend. The frequency and severity of cybersecurity attacks are exploding.  We've seen news of a sprawling hack involving the SolarWinds management platform. That attack may have compromised the systems of over 18,000 SolarWinds customers.  Then,",
          "link": "https://www.freecodecamp.org/news/how-to-secure-your-android-app/",
          "publishedOn": "2021-05-28T16:01:05.000Z",
          "wordCount": 1568,
          "title": "How to Secure Your Android App – Four Security Best Practices Every Android Dev Should Know"
        },
        {
          "id": "60b0de2211ffb70827ef8d7c",
          "author": null,
          "description": "More and more applications are using computer vision these days. We just published a full course on the freeCodeCamp.org YouTube channel that will help you learn advanced computer vision using Python. You will learn state of the art computer vision techniques by building five projects with libraries such as",
          "link": "https://www.freecodecamp.org/news/advanced-computer-vision-with-python/",
          "publishedOn": "2021-05-28T12:26:38.000Z",
          "wordCount": 368,
          "title": "Advanced Computer Vision with Python"
        },
        {
          "id": "60af931811ffb70827ef85d3",
          "author": null,
          "description": "When you're training a machine learning model, you can have some features in your dataset that represent categorical values. Categorical features are types of data that you can divide into groups. There are three common categorical data types: Ordinal – a set of values in ascending or descending order. Example: rating",
          "link": "https://www.freecodecamp.org/news/improve-machine-learning-model-performance-by-combining-categorical-features/",
          "publishedOn": "2021-05-27T17:55:23.000Z",
          "wordCount": 1828,
          "title": "How to Improve Machine Learning Model Performance by Combining Categorical Features"
        },
        {
          "id": "60a325c6906c5207e3a7da25",
          "author": null,
          "description": "In this article, I'll teach you how to make a basketball using materials and textures in Unity. You can extend this micro-concept to create any kind of ball like a football, tennis ball, or snooker balls.  That said, these techniques aren't just limited to creating round 3D objects like balls.",
          "link": "https://www.freecodecamp.org/news/how-to-make-a-basketball-in-unity-with-materials-and-textures/",
          "publishedOn": "2021-05-27T15:16:34.000Z",
          "wordCount": 1399,
          "title": "How to Make a Bouncing Basketball in Unity with Materials and Textures 🏀"
        },
        {
          "id": "60a44b9f906c5207e3a7e098",
          "author": null,
          "description": "In this tutorial you will create an app that generates dynamic animated text using Giphy's API with ReactJS. After that I'll go over some of the other API features Giphy provides that you can use to make other interesting projects. You can find the code for the tutorial here. Video",
          "link": "https://www.freecodecamp.org/news/giphy-api-tutorial/",
          "publishedOn": "2021-05-26T21:44:01.000Z",
          "wordCount": 2014,
          "title": "Giphy API Tutorial – How to Generate Animated Text GIFs with ReactJS"
        },
        {
          "id": "60abe7fb11ffb70827ef63a6",
          "author": null,
          "description": "If you're a developer, you've probably come across the term \"open source.\" If you've ever wondered what it's all about and how to contribute, you are in exactly the right place.  I put aside all my fears about how and what to contribute during Hacktoberfest 2020, and made",
          "link": "https://www.freecodecamp.org/news/how-to-contribute-to-open-source-projects-beginners-guide/",
          "publishedOn": "2021-05-26T18:01:00.000Z",
          "wordCount": 2359,
          "title": "How to Contribute to Open Source  Projects – A Beginner&#x27;s Guide"
        },
        {
          "id": "606f4f5fd5756f080ba96b65",
          "author": null,
          "description": "In this article, I'll give you a brief overview of the configuration syntax of Terraform.  Terraform's docs provide the most comprehensive look at its syntax. But this article should serve as a condensed quick start introduction that'll give new users a simplified overview. We'll focus on the basic structures without",
          "link": "https://www.freecodecamp.org/news/terraform-syntax-for-beginners/",
          "publishedOn": "2021-05-26T18:00:52.000Z",
          "wordCount": 3782,
          "title": "Learn Basic Terraform Syntax in 20 minutes"
        },
        {
          "id": "60abc59d11ffb70827ef6304",
          "author": null,
          "description": "In this article, I'll walk you through how to set up your own GraphQL API using PHP and Laravel. Two years ago, I started working professionally as a backend developer. And I was very intimidated by all the technology I didn't yet know. Words like Docker, Kubernetes, and GraphQL seemed",
          "link": "https://www.freecodecamp.org/news/build-a-graphql-api-using-laravel/",
          "publishedOn": "2021-05-26T16:34:32.000Z",
          "wordCount": 3054,
          "title": "How to Build a GraphQL API Using Laravel"
        },
        {
          "id": "60aced0011ffb70827ef6d96",
          "author": null,
          "description": "In this video course I show you how to build three popular games using the latest game development library for JavaScript called Kaboom.js. This course is exciting for two reasons: First of all, I am going to be introducing a new technology designed especially for game development in JavaScript.",
          "link": "https://www.freecodecamp.org/news/how-to-build-mario-zelda-and-space-invaders-with-kaboom-js/",
          "publishedOn": "2021-05-26T14:12:27.000Z",
          "wordCount": 1273,
          "title": "How to Build Super Mario Bros, Zelda, and Space Invaders with Kaboom.js"
        },
        {
          "id": "60ac3a2711ffb70827ef6aec",
          "author": null,
          "description": "Walkthrough for Hack The Box Valentine machine",
          "link": "https://www.freecodecamp.org/news/keep-calm-and-hack-the-box-valentine/",
          "publishedOn": "2021-05-25T22:43:11.000Z",
          "wordCount": 1664,
          "title": "Keep Calm and Hack The Box – Valentine"
        },
        {
          "id": "60a93b0011ffb70827ef5b0d",
          "author": null,
          "description": "In HTML, it’s the default behavior for forms to redirect to a new page whenever they're submitted. So in order to provide dynamic functionality, React uses a strategy called controlled components. If you have recently gone through a React course, you probably didn't like this part, because there are",
          "link": "https://www.freecodecamp.org/news/how-to-use-react-hook-form-with-chakra-ui/",
          "publishedOn": "2021-05-25T20:26:38.000Z",
          "wordCount": 1748,
          "title": "Chakra UI and React-Hook-Form –How to Build Beautiful Forms"
        },
        {
          "id": "608706aedd38b9088c2c012c",
          "author": null,
          "description": "If you're a beginner developer, it can be difficult to find ways to use your limited knowledge to support yourself. And at the same time, you won't be able to hone your skills if you aren't using them full time.  It's a precarious spot that I remember being in when",
          "link": "https://www.freecodecamp.org/news/web-design-best-practices-for-new-developers/",
          "publishedOn": "2021-05-25T16:51:37.000Z",
          "wordCount": 1940,
          "title": "How to Create Portfolio-Worthy Work – Web Design Best Practices for New Developers"
        }
      ]
    },
    {
      "title": "Quanta Magazine",
      "feedUrl": "https://api.quantamagazine.org/feed/",
      "siteUrl": "https://www.quantamagazine.org",
      "articles": [
        {
          "id": "https://www.quantamagazine.org/?p=105347",
          "author": "Scott Aaronson",
          "description": "To understand what quantum computers can do — and what they can’t — avoid falling for overly simple explanations.            \nThe post What Makes Quantum Computing So Hard to Explain? first appeared on Quanta Magazine",
          "link": "https://www.quantamagazine.org/why-is-quantum-computing-so-hard-to-explain-20210608/",
          "publishedOn": "2021-06-08T15:10:05.000Z",
          "wordCount": null,
          "title": "What Makes Quantum Computing So Hard to Explain?",
          "itunes": {}
        },
        {
          "id": "https://www.quantamagazine.org/?p=105340",
          "author": "Robin George Andrews",
          "description": "Scientists have long struggled to understand how common planets form. A new supercomputer simulation shows that the missing ingredient may be magnetism.            \nThe post Astronomers Find Secret Planet-Making Ingredient: Magnetic Fields first appeared on Quanta Magazine",
          "link": "https://www.quantamagazine.org/simulation-reveals-how-magnetism-helps-form-planets-20210607/",
          "publishedOn": "2021-06-07T14:02:18.000Z",
          "wordCount": null,
          "title": "Astronomers Find Secret Planet-Making Ingredient: Magnetic Fields",
          "itunes": {}
        },
        {
          "id": "https://www.quantamagazine.org/?p=105275",
          "author": "Mordechai Rorvig",
          "description": "A new proof establishes the boundary at which a shape becomes so corrugated, it can be crushed.            \nThe post Mathematicians Identify Threshold at Which Shapes Give Way first appeared on Quanta Magazine",
          "link": "https://www.quantamagazine.org/mathematicians-identify-threshold-at-which-shapes-give-way-20210603/",
          "publishedOn": "2021-06-03T13:49:34.000Z",
          "wordCount": null,
          "title": "Mathematicians Identify Threshold at Which Shapes Give Way",
          "itunes": {}
        },
        {
          "id": "https://www.quantamagazine.org/?p=105224",
          "author": "Max Kozlov",
          "description": "In some symbiotic partnerships, an RNA-based mechanism may sabotage the growth of greedy hosts.            \nThe post RNA Brakes May Stabilize a Cellular Symbiosis first appeared on Quanta Magazine",
          "link": "https://www.quantamagazine.org/rna-brakes-may-stabilize-a-cellular-symbiosis-20210602/",
          "publishedOn": "2021-06-02T13:53:55.000Z",
          "wordCount": null,
          "title": "RNA Brakes May Stabilize a Cellular Symbiosis",
          "itunes": {}
        },
        {
          "id": "https://www.quantamagazine.org/?p=105076",
          "author": "Robin George Andrews",
          "description": "Scientists have begun to decipher the subtle signs that reveal how explosive a volcanic eruption is going to be.             \nThe post A Burp or a Blast? Seismic Signals Reveal the Volcanic Eruption to Come first appeared on Quanta Magazine",
          "link": "https://www.quantamagazine.org/seismic-data-helps-scientists-forecast-volcanic-explosions-20210601/",
          "publishedOn": "2021-06-01T17:02:41.000Z",
          "wordCount": null,
          "title": "A Burp or a Blast? Seismic Signals Reveal the Volcanic Eruption to Come",
          "itunes": {}
        },
        {
          "id": "https://www.quantamagazine.org/?p=104957",
          "author": "Pradeep Mutalik",
          "description": "Playing with numbers can lead to deep mathematical and scientific insights.            \nThe post How a Simple Arithmetic Puzzle Can Guide Discovery first appeared on Quanta Magazine",
          "link": "https://www.quantamagazine.org/how-a-simple-math-puzzle-can-guide-discovery-20210528/",
          "publishedOn": "2021-05-28T16:40:17.000Z",
          "wordCount": null,
          "title": "How a Simple Arithmetic Puzzle Can Guide Discovery",
          "itunes": {}
        },
        {
          "id": "https://www.quantamagazine.org/?p=104933",
          "author": "Steve Nadis",
          "description": "Jordan Ellenberg enjoys studying — and writing about — the mathematics underlying everyday phenomena.            \nThe post A Number Theorist Who Connects Math to Other Creative Pursuits first appeared on Quanta Magazine",
          "link": "https://www.quantamagazine.org/a-number-theorist-who-connects-math-to-other-creative-pursuits-20210527/",
          "publishedOn": "2021-05-27T14:37:45.000Z",
          "wordCount": null,
          "title": "A Number Theorist Who Connects Math to Other Creative Pursuits",
          "itunes": {}
        },
        {
          "id": "https://www.quantamagazine.org/?p=104828",
          "author": "Jonathan O'Callaghan",
          "description": "Groundbreaking results show that neutron stars of different masses may have the same size — upending astrophysical models.             \nThe post Squishy Neutron Star Setback Dampens Hopes of Exotic Matter first appeared on Quanta Magazine",
          "link": "https://www.quantamagazine.org/squishy-neutron-star-setback-dampens-hopes-of-exotic-matter-20210526/",
          "publishedOn": "2021-05-26T14:46:35.000Z",
          "wordCount": null,
          "title": "Squishy Neutron Star Setback Dampens Hopes of Exotic Matter",
          "itunes": {}
        },
        {
          "id": "https://www.quantamagazine.org/?p=104803",
          "author": "Kelsey Houston-Edwards",
          "description": "Hilbert’s 12th problem asked for novel analogues of the roots of unity, the building blocks for certain number systems. Now, over 100 years later, two mathematicians have produced them.            \nThe post Mathematicians Find Long-Sought Building Blocks for Special Polynomials first appeared on Quanta Magazine",
          "link": "https://www.quantamagazine.org/mathematicians-find-polynomial-building-blocks-hilbert-sought-20210525/",
          "publishedOn": "2021-05-25T15:05:58.000Z",
          "wordCount": null,
          "title": "Mathematicians Find Long-Sought Building Blocks for Special Polynomials",
          "itunes": {}
        },
        {
          "id": "https://www.quantamagazine.org/?p=104743",
          "author": "Jordana Cepelewicz",
          "description": "New work suggests that the radiolytic splitting of water supports giant subsurface ecosystems of life on Earth — and could do it elsewhere, too.            \nThe post Radioactivity May Fuel Life Deep Underground and Inside Other Worlds first appeared on Quanta Magazine",
          "link": "https://www.quantamagazine.org/radioactivity-may-fuel-life-deep-underground-and-inside-other-worlds-20210524/",
          "publishedOn": "2021-05-24T15:50:23.000Z",
          "wordCount": null,
          "title": "Radioactivity May Fuel Life Deep Underground and Inside Other Worlds",
          "itunes": {}
        },
        {
          "id": "https://www.quantamagazine.org/?p=104485",
          "author": "Natalie Wolchover",
          "description": "Supermassive black holes emit jets of white-hot plasma that stretch thousands of light-years across the cosmos. For the first time, researchers have identified what’s creating these jets.            \nThe post Physicists Identify the Engine Powering Black Hole Energy Beams first appeared on Quanta Magazine",
          "link": "https://www.quantamagazine.org/physicists-identify-the-engine-powering-black-hole-energy-beams-20210520/",
          "publishedOn": "2021-05-20T16:42:04.000Z",
          "wordCount": null,
          "title": "Physicists Identify the Engine Powering Black Hole Energy Beams",
          "itunes": {}
        }
      ]
    },
    {
      "title": "Labnotes (by Assaf Arkin)",
      "feedUrl": "https://labnotes.org/rss/",
      "siteUrl": "https://labnotes.org/",
      "articles": [
        {
          "id": "60b507628a05e833bcdafbdf",
          "author": "Assaf Arkin",
          "description": "This week we add a soundtrack to the progress bar, ask for that dashboard we’ll never use, play Traffic Light Hero, and pop a bubble.",
          "link": "https://labnotes.org/weekend-reading-gangster-coworking/",
          "publishedOn": "2021-06-05T19:26:41.000Z",
          "wordCount": 1177,
          "title": "Weekend Reading —🍿 Gangster Coworking"
        },
        {
          "id": "60a9594fa030cd25014cdf4f",
          "author": "Assaf Arkin",
          "description": "This week is the seven year itch, should have bought that dip, but at least you won’t get caught by cheese, also that iron-pumping gator.",
          "link": "https://labnotes.org/weekend-reading-summer-gonna-be-crazzzyy/",
          "publishedOn": "2021-05-29T20:41:21.000Z",
          "wordCount": 1060,
          "title": "Weekend Reading — 😎 Summer gonna be crazzzyy"
        },
        {
          "id": "60a041b7b773846ea8801c67",
          "author": "Assaf Arkin",
          "description": "This week we lead by introversion, anticipate a blog comeback, count sandwiches, and if you're over 30 you're most likely to injure yourself when you sleep.",
          "link": "https://labnotes.org/weekend-reading-normalize-relational-databases/",
          "publishedOn": "2021-05-22T19:18:40.000Z",
          "wordCount": 1543,
          "title": "Weekend Reading — Normalize relational databases"
        },
        {
          "id": "6096e98e9af1f92127d87753",
          "author": "Assaf Arkin",
          "description": "This week we ride downhill, chill in the lo-fi cafe, feel old, dress to impress, and watch the trash.",
          "link": "https://labnotes.org/weekend-reading-when-the-internet-came-on-a-cd/",
          "publishedOn": "2021-05-15T21:46:44.000Z",
          "wordCount": 1353,
          "title": "Weekend Reading — 💿 When the internet came on a CD"
        }
      ]
    },
    {
      "title": "Stefan Judis Web Development",
      "feedUrl": "https://www.stefanjudis.com/rss.xml",
      "siteUrl": "https://www.stefanjudis.com/rss.xml",
      "articles": [
        {
          "id": "https://www.stefanjudis.com/blog/web-weekly-22/",
          "author": null,
          "description": "Welcome to Web Weekly #22!\n\nHello friends! It's summer here in Berlin! I mean, almost... 🙈 And I might have made it to get a slight sunburn today. I also started working on a new custom element for my blog (<web-compat />) to show always-up-to-date browser support information in my blog posts. It was a good week!\nBefore we jump into web stuff, let me share something fascinating with you, this video shows the creation of a beautiful animation without using a computer.\n\n\n          \n            \nThis week's Web Weekly includes:\nJSON modules in JavaScript\nLighthouse updates\nCSS Font descriptors\n... and, as always, GitHub repositories, a new Tiny Helper and some music.\nReady? Steady. Go!\nThe benefits of asynchronous communication\n\n\n\n\n\n\n          \n            \nOldie gut goldie – I'm working fro…",
          "link": "https://www.stefanjudis.com/blog/web-weekly-22/",
          "publishedOn": "2021-06-06T21:00:00.000Z",
          "wordCount": 1254,
          "title": "Web Weekly #22 (#blogPost)"
        },
        {
          "id": "https://www.stefanjudis.com/today-i-learned/css-defines-color-values-that-follow-system-preferences/",
          "author": null,
          "description": "I learned something exciting from Jim Nielsen today. Jim shared that CSS defines system color values that follow the system color preferences (light and dark mode). If you want to learn more about the nitty-gritty details, read his post or have a look at the CSS Color Module Level 4 specification.\nThis post shares my discoveries after playing around with system color values such as Canvas and CanvasText.\nYou can find all defined system color values in the example below. Change your color preferences and see the colors below adjust!\n\nYou can see the colors react to system preferences in Chrome and Safari in the video below, too.\nHere are a few things I noticed. 👇\nAt the time of writing, it appears that only Chromies' and Safari's system color values take the system preferences into conside…",
          "link": "https://www.stefanjudis.com/today-i-learned/css-defines-color-values-that-follow-system-preferences/",
          "publishedOn": "2021-06-05T22:00:00.000Z",
          "wordCount": 621,
          "title": "CSS defines color values that follow system preferences (#tilPost)"
        },
        {
          "id": "https://www.stefanjudis.com/snippets/how-to-import-json-files-in-es-modules/",
          "author": null,
          "description": "If you're using EcmaScript modules, you probably know the problem that you can't \"just\" import JSON files. To import and load a JSON file in an ES module, you have to do a \"window.fetch dance\" to request the file and parse it yourself. It's not great...\nBut there's hope! According to chromestatus.com, JSON Modules are shipping in Chrome 91. I gave it a quick try, and surprisingly, the following JavaScript code does not work.\n<script type=\"module\">\n  import data from \"./data.json\";\n  console.log(data);\n</script>\n\nIt throws the following exception in Chrome 91:\nFailed to load module script: Expected a JavaScript module script but the server responded with a MIME type of \"application/json\". Strict MIME type checking is enforced for module scripts per HTML spec.\nI didn't have a detailed look at the spec discussion about this topic, but apparently, the new syntax to import JSON Modules is the following. 😲\nimport data from \"./data.json\" assert { type: \"json\" };\n\nconsole.log(data);\n\nThat's quite something, and I have to do some reading about it. But hey, anything that makes it easier to import JSON is more than welcome!\nAnd when there's a solution in Chrome, it can't be long until it ships in Node.js because importing JSON files in Node ES modules is not great either. 🙈\nEdit: Axel Rauschmayer shared that JSON import are based on import assertions and you can read more about it on his blog.\n\n\n          \n          \n            Reply to Stefan",
          "link": "https://www.stefanjudis.com/snippets/how-to-import-json-files-in-es-modules/",
          "publishedOn": "2021-06-05T22:00:00.000Z",
          "wordCount": 419,
          "title": "How to import JSON files in ES modules (#snippet)"
        },
        {
          "id": "https://www.stefanjudis.com/blog/web-weekly-21/",
          "author": null,
          "description": "Welcome to Web Weekly #21!\n\nHello friends! I'm a few hours late because I had such a lovely weekend. I saw some friends, listened to music and read an entertaining book. 😊 It felt like the first \"somewhat normal\" weekend for ages here in Berlin. I hope this madness is getting to an end where you live, too!\nBefore we jump into web stuff, let me share with you what made me smile this week. If you're into dogs (or trampolines), this video is just too cute.\n\nThis week's Web Weekly includes:\ncutting-edge CSS features\nthe soon-to-be cross-browser supported requestSubmit method\nthe address HTML element\n... and, as always, GitHub repositories, a new Tiny Helper and some music.\nReady? Steady. Go!\nThings to not do yourself – email address validation\n\n\n\n\n\n          \n            \nWhen doing web devel…",
          "link": "https://www.stefanjudis.com/blog/web-weekly-21/",
          "publishedOn": "2021-05-30T22:00:00.000Z",
          "wordCount": 1255,
          "title": "Web Weekly #21 (#blogPost)"
        },
        {
          "id": "https://www.stefanjudis.com/snippets/how-to-add-a-directory-but-ignore-included-files-in-git/",
          "author": null,
          "description": "This post is a quick reference for my future self. I implemented the eleventy cache assets plugin to speed up my local development last weekend. This site is based on API data from several sources, and unfortunately, local development became terribly slow. It was time for some optimization. The problem was that the local build process fetched all the API data on every file change and local rebuild.\nThe eleventy cache plugin helps here. It caches data across builds and writes the API data into files in a .cache directory. When the site rebuilds, the cached data is reused, and no APIs will be called during the build process.\nTo make the plugin work in a remote environment such as Netlify, it needs the .cache directory to be available. This behavior led to the problem that I had to check in the .cache directory but needed to ignore all the included files.\nI ran into this exact problem many times, and it always takes me several attempts to get it right. Here's the solution that worked for me.\nFirst, add the directory to your local project and place a .gitignore file in it.\n.cache\n  |_ .gitignore\n\nThen, paste the following configuration into the .gitignore file in the directory you want to check in.\n# File: .cache/.gitignore\n# Ignore everything in this directory\n*\n# Except for this file\n!.gitignore\n\nAnd voilà! Commit the .gitignore file at folder-you-want-to-check-in/.gitignore, and that's it! The directory is now available in git and files in this directory will be ignored.\nIt's to point out that .gitignore files work in sub-directories and allow you to configure git on a sub-directory level. And that's pretty handy!\n\n\n          \n          \n            Reply to Stefan",
          "link": "https://www.stefanjudis.com/snippets/how-to-add-a-directory-but-ignore-included-files-in-git/",
          "publishedOn": "2021-05-30T22:00:00.000Z",
          "wordCount": 476,
          "title": "How to add a directory but ignore included files in git (#snippet)"
        },
        {
          "id": "https://www.stefanjudis.com/blog/web-weekly-20/",
          "author": null,
          "description": "Welcome to Web Weekly #20!\n\nHello friends! Do you remember last week? I was so proud of sending this tiny newsletter to 1000 people for the first time. In the previous seven days, 200 more people signed up. 😲 I'm so grateful and excited to have you all read along! A big welcome to all the new subscribers!\nBefore we jump into web stuff, let me share with you what made me laugh this week. Check out this URL lengthener (yes, you read that right!): the idea, the URL, the wording... I love everything about this random project. 🙈\n\n\n          \n            \nThis week's Web Weekly includes:\na free live-caption service\nautomation with Puppeteer\nNode.js running natively in the browser\n... and, as always, GitHub repositories, a new Tiny Helper and some music.\nReady? Steady. Go!\nA tool to find the RS…",
          "link": "https://www.stefanjudis.com/blog/web-weekly-20/",
          "publishedOn": "2021-05-23T22:00:00.000Z",
          "wordCount": 1254,
          "title": "Web Weekly #20 (#blogPost)"
        },
        {
          "id": "https://www.stefanjudis.com/today-i-learned/how-parameter-expansion-helps-to-not-delete-everything/",
          "author": null,
          "description": "While tweaking my dotfiles and writing some auto-completion shell scripts, I almost got myself into trouble.\nThe script in question included the following lines:\nTARGET_DIR=\"plugins\"\nrm -rf \"$TARGET_DIR/\"\n\nYou probably know the situation. You're trying to develop a shell script. It won't be pretty but hopefully gets the job done. You google how to use an if or how to run a loop. You're probably frustrated (I was at least), and you don't realize that your script could mess with your machine's file system because you're fiddling around with rm -rf.\nYou always have to be very careful when using rm -rf! Things can go particularly wrong when you use rm in combination with variables. Let's imaging my fat fingers comment out the first line and I run this script. My rm -rf plugins/ command just be…",
          "link": "https://www.stefanjudis.com/today-i-learned/how-parameter-expansion-helps-to-not-delete-everything/",
          "publishedOn": "2021-05-23T22:00:00.000Z",
          "wordCount": 765,
          "title": "How parameter expansion helps to not accidentally delete all the files on your machine (#tilPost)"
        },
        {
          "id": "https://www.stefanjudis.com/snippets/a-custom-dev-command-with-auto-completion/",
          "author": null,
          "description": "I went into the rabbit hole of writing shell scripting today. 🙈 The goal: saving keystrokes and manually ran commands when starting to work on a project.\nHere's the result. 👇\nThe video above shows a custom dev command that:\nnavigates into a project\nruns npm run dev\nopens VS Code\nThe exciting part is that it supports auto-completion to pass paths to projects with a working npm run dev command quickly.\nA shell function to run multiple commands\n\nTo define a custom shell function that runs various commands add the following lines to your .zshrc or .bashrc.\nfunction dev() {\n  echo \"Running 'npm run dev' in $1 ...\"\n  cd ~/Projects/\"$1\" || return\n  code .\n  npm run dev\n}\n\nRun source ~/.zshrc/source ~/.bashrc or open a new terminal session to load the new configuration. Tada!!! You now have a ne…",
          "link": "https://www.stefanjudis.com/snippets/a-custom-dev-command-with-auto-completion/",
          "publishedOn": "2021-05-22T22:00:00.000Z",
          "wordCount": 824,
          "title": "A custom \"dev\" command with auto-completion (#snippet)"
        },
        {
          "id": "https://www.stefanjudis.com/blog/web-weekly-19/",
          "author": null,
          "description": "Welcome to Web Weekly #19!\n\nHello friends! This week was exciting. I was invited to the \"Mission Control\" podcast, but more importantly, my tiny newsletter hit 1k subscribers! Thank you so much for reading along! 💙\nBefore we jump into web stuff, are you up for something thrilling? Look at this MacBook in danger. I'm not spoiling what happens there, but I love how random it is. 🙈\n\n\n\n\n          \n            \nThis week's Web Weekly includes:\nresources on successful open source\na guide to ECMAscript modules in Node.js\nfit-content in CSS\n... and, as always, GitHub repositories, a new Tiny Helper and some music.\nReady? Steady. Go!\nDon't yell at people that do open source\n\n\n\n\n\n          \n            \nI'm not doing much open source work these days, but I used to maintain one popular open source …",
          "link": "https://www.stefanjudis.com/blog/web-weekly-19/",
          "publishedOn": "2021-05-15T22:00:00.000Z",
          "wordCount": 1065,
          "title": "Web Weekly #19 (#blogPost)"
        },
        {
          "id": "https://www.stefanjudis.com/notes/css-inset-is-supported-across-all-major-browsers/",
          "author": null,
          "description": "The CSS property inset is a new shorthand for top, right, bottom and left. Today I found out that Safari supports it starting with 14.1, which means that the CSS property is now supported across all major browsers. 🎉\n\n\n\n\n          \n            \n(The MDN data for Edge seems to be incorrect. I tested the current Edge and it worked fine.)\nIf you want to learn what it's about, have a look at the #devsheet I tweeted a year ago.\n\n      \n        \n      \n    \n\n\n          \n          \n            Reply to Stefan",
          "link": "https://www.stefanjudis.com/notes/css-inset-is-supported-across-all-major-browsers/",
          "publishedOn": "2021-05-15T22:00:00.000Z",
          "wordCount": 281,
          "title": "CSS \"inset\" is supported across all major browsers (#note)"
        },
        {
          "id": "https://www.stefanjudis.com/notes/how-to-start-using-all-the-aliases-you-set-up-and-forgot/",
          "author": null,
          "description": "How many shell aliases do you have set up on your machine? I have set up quite a few general and git aliases in my config files and must admit that I still run npm install or git add because the aliases didn't make it into my muscle memory.\nThe plugin alias-tips can help with that. It parses your commands and tells you to save some keystrokes and use the alias instead. It's beautiful!\nSee it in action below. 👇\n\n      \n        \n      \n    \n\n\n          \n          \n            Reply to Stefan",
          "link": "https://www.stefanjudis.com/notes/how-to-start-using-all-the-aliases-you-set-up-and-forgot/",
          "publishedOn": "2021-05-15T22:00:00.000Z",
          "wordCount": 312,
          "title": "How to start using all the aliases you set up (and forgot) (#note)"
        },
        {
          "id": "https://www.stefanjudis.com/snippets/how-to-import-json-files-in-es-modules-node-js/",
          "author": null,
          "description": "ES modules are still reasonably new in Node.js land (they're stable since Node 14). Modules come with a built-in module system and features such as top-level await.\nI just read an informative post on ES modules by Pawel Grzybek and learned that you can't import JSON files in ES modules today. That's a real bummer because I'm pretty used to doing const data = require('./some-file.json') in Node.js.\nWhile it will be possible to import JSON from within modules eventually, the implementation is still behind a flag (--experimental-json-modules).\nThis post includes ways to deal with JSON in ES modules today.\nOption 1: Read and parse JSON files yourself\n\nThe Node.js documentation advises to use the fs module and do the work of reading the files and parsing it yourself.\nimport { readFile } from 'fs/promises';\nconst json = JSON.parse(\n  await readFile(\n    new URL('./some-file.json', import.meta.url)\n  )\n);\n\nOption 2: Leverage the CommonJS require function to load JSON files\n\nThe documentation also states that you can use createRequire to load JSON files. This is the way Pawel advises in his blog post.\ncreateRequire allows you to construct a CommonJS require function so that you can use typical CommonJS features in Node.js EcmaScript modules.\nimport { createRequire } from \"module\";\nconst require = createRequire(import.meta.url);\nconst data = require(\"./data.json\");\n\nHow should you load JSON files?\n\nI don't know. 🤷‍♂️ Neither option feels good, and I'll probably stick to the first option because it's more understandable.\nLet's see when stable JSON modules land in Node.js!\n\n\n          \n          \n            Reply to Stefan",
          "link": "https://www.stefanjudis.com/snippets/how-to-import-json-files-in-es-modules-node-js/",
          "publishedOn": "2021-05-15T22:00:00.000Z",
          "wordCount": 439,
          "title": "How to import JSON files in ES modules (Node.js) (#snippet)"
        },
        {
          "id": "https://www.stefanjudis.com/today-i-learned/how-to-define-open-graph-twitter-image-alt-text-and-why-it-might-not-matter/",
          "author": null,
          "description": "You know all these fancy link previews that you see on social media when people share articles and resources, right? These previews are based on various meta elements defined in your website's head. You can define the Twitter card layout using <meta property=\"twitter:card\" content=\"summary_large_image\">, specify the Facebook preview image with <meta property=\"og:image\" content=\"https://.../your-image.jpg\"/> and many more configuration options.\n\n\n\n\n          \n            \nRead more about the details in the documentation:\nthe Open Graph Protocol\nTwitter cards\nRecently I learned that the two standards (Open Graph and Twitter cards) support alternative text for preview images. I want to be a good web citizen and implemented it right away.\nUnfortunately, I discovered that the alternative text d…",
          "link": "https://www.stefanjudis.com/today-i-learned/how-to-define-open-graph-twitter-image-alt-text-and-why-it-might-not-matter/",
          "publishedOn": "2021-05-13T22:00:00.000Z",
          "wordCount": 854,
          "title": "How to define Open Graph / Twitter image alt text (and why it might not matter...) (#tilPost)"
        }
      ]
    }
  ],
  "cliVersion": "1.10.2"
}